%
&
+
1
2
3
4
5
6
7
8
9
<
=
A
AA
AB
ABC
AC
ACT
AD
AG
AI
AK
AL
AM
AN
AND
AP
API
AR
AS
AT
AU
About
Access
Act
Action
Active
Ad
After
Age
Agent
Ah
Al
Alex
All
Alpha
Also
Alt
Am
America
American
An
And
Android
Ang
Animation
Answer
Any
Application
Arch
Are
Area
Arm
Art
As
Assembly
At
Atlas
Audio
August
Author
Auto
Axis
B
BA
BC
BR
BS
Back
Background
Bad
Bar
Base
Basic
Be
Bean
Before
Bel
Ben
Best
Big
Bit
Black
Block
Blue
Bo
Board
Bob
Body
Book
Border
Bottom
Box
Brain
Bus
But
By
C
CA
CB
CC
CD
CE
CF
CH
CO
CP
CR
CS
CT
Cal
Calendar
Call
Cam
Camera
Can
Cap
Capt
Car
Card
Case
Cast
Cat
Category
Cell
Center
Ch
Chain
Change
Changes
Channel
Character
Chart
Check
Child
Children
Cho
Choice
Christ
City
Class
Clear
Close
Cloud
Co
Code
Col
Collection
Collections
Color
Come
Command
Common
Company
Complete
Con
Connection
Contact
Content
Control
Controller
Cook
Core
Could
Count
Counter
Country
Created
Culture
Current
Custom
Cy
D
DB
DC
DD
DE
DL
DR
DS
Da
Dan
Daniel
Data
Database
Date
David
Day
Days
De
Dec
Del
Delta
Den
Der
Des
Det
Dev
Di
Dictionary
Did
Die
Digital
Direct
Direction
Directory
Distance
Do
Doc
Does
Dom
Domain
Don
Donald
Done
Double
Down
Dr
Draw
Drawing
Driver
Drop
E
EC
EP
ER
ET
Each
Ed
Edge
Edit
Editor
Effect
El
Elements
Em
Empty
En
End
Engine
English
Entry
Environment
Equal
Europe
Event
Events
Every
Ex
Exit
Express
Extension
External
Extra
F
FA
FC
FF
FL
FM
FX
Face
Factory
Family
Fe
Feature
Fi
Field
Fields
File
Files
Fin
Final
Find
Fire
First
Flag
Flags
Flow
Focus
Foot
For
Foreign
Form
Found
Foundation
Fr
Framework
France
Free
From
Front
Full
Fun
Future
G
GA
GB
GE
GM
GO
GP
GT
Game
Gamma
Gen
General
Get
Global
Go
Good
Google
Green
Group
Groups
H
HC
HD
HP
Ha
Hand
Has
Have
He
Head
Height
Hello
Help
Her
Here
Hi
Hidden
High
History
Hold
Home
Host
Hot
How
However
Hz
I
ID
IF
IGN
II
III
IL
IN
IP
IS
ISBN
ISO
IT
IV
IX
Identity
If
Il
Image
Images
In
Index
Information
Initial
Inner
Institut
Inter
Internal
Internet
Introduction
Is
It
Italia
J
Jack
James
Jan
Java
Je
Jean
Jo
Job
John
Jose
Jul
Just
K
Ke
Key
Keys
Kind
Kit
L
LA
LED
LL
LP
La
Lab
Label
Land
Language
Last
Launch
Le
Left
Len
Length
Les
Let
Level
Li
Library
Life
Light
Like
Lin
Line
Lines
Link
Linux
List
Live
Lo
Local
Location
Lock
Long
Look
Loop
Los
Lou
Louis
Lower
Lu
M
MA
MB
MC
MD
ME
MI
MIT
MP
MR
MS
MW
Ma
Mac
Machine
Mad
Mail
Main
Make
Mal
Man
Management
Manager
Many
Map
Mar
Marie
Mark
Mart
Martin
Mask
Master
Mat
Match
Material
Math
Matrix
Max
May
Maybe
Me
Media
Member
Memory
Men
Message
Met
Method
Michael
Microsoft
Middle
Mill
Min
Miss
Mo
Mobile
Mode
Model
Models
Mon
Mont
Month
More
Mount
Mouse
Move
Movie
Mr
Multi
Music
My
N
NC
NE
NL
NO
Na
Name
Named
Names
National
Native
Navigation
Net
Network
New
News
Next
No
Non
None
Normal
Not
Note
Nothing
Nov
Now
Number
Numbers
O
OF
OH
OK
ON
ONE
OR
OS
Observer
Oct
Of
Off
Office
Oh
Ok
Old
Omega
On
Once
One
Only
Op
Open
Operation
Or
Order
Organ
Origin
Original
Other
Out
Over
P
PA
PC
PD
PDF
PM
PP
PR
PS
PT
Pa
Pack
Page
Pan
Panel
Part
Pass
Pat
Path
Paul
Pay
Per
Period
Person
Peter
Ph
Phi
Phone
Photo
Pi
Picture
Pierre
Place
Plan
Platform
Play
Player
Please
Plus
Po
Point
Points
Pol
Policy
Pool
Pop
Port
Post
Power
Pre
Press
Price
Primary
Print
Private
Pro
Problem
Process
Product
Products
Profile
Program
Progress
Project
Projects
Properties
Property
Protocol
Pub
Public
Put
Python
Q
Que
Question
R
RA
RAM
RC
ROM
RS
Radio
Random
Range
Rate
Raw
Re
Read
Reader
Ready
Real
Record
Red
Reference
Reg
Region
Register
Release
Rep
Report
Resource
Resources
Response
Rest
Results
Return
Rich
Right
Rob
Role
Root
Route
Row
Rule
Run
Runner
Running
Russ
S
SA
SC
SD
SE
SF
SH
SK
SL
SM
SP
SR
SS
ST
SV
Sa
Saint
Sal
Sam
San
Save
Sc
Scale
Scene
Score
Screen
Se
Search
Second
Seconds
Secret
Section
Security
See
Select
Selected
Selection
Self
Send
Ser
Series
Server
Service
Services
Session
Set
She
Shell
Short
Should
Show
Si
Side
Sigma
Sign
Simple
Since
Sing
Single
Site
Smith
So
Sol
Some
Something
Sound
Source
Space
Special
Speed
Split
Spring
St
Stage
Stand
Standard
Star
Start
State
Station
Status
Step
Stop
Store
Story
Strategy
Stream
String
Strings
Student
Studio
Style
Su
Sub
Success
Super
Support
Sur
System
T
TD
THE
TO
TV
TX
Table
Tag
Take
Target
Task
Te
Team
Test
Tests
Tex
Text
Thank
Thanks
That
The
Theme
Then
There
They
This
Three
Tim
Time
Times
Title
To
Tom
Top
Total
Touch
Trace
Track
Trans
Transport
Tree
Tri
True
Try
Tu
Turn
Two
Ty
Type
U
UC
UK
UN
UP
US
USA
UTC
Un
Under
Union
Unit
Unknown
Up
Updated
Upper
Us
Use
Users
Using
V
VA
VC
VI
VP
Val
Value
Verlag
Version
Video
View
Virtual
Visual
Vol
Volume
W
WA
WR
Wait
Warning
Watch
We
Web
Week
Weight
Well
West
What
When
Where
White
Who
Why
Will
Win
Window
Windows
With
Word
Work
Worker
World
Writer
X
XML
XV
Y
Year
Yes
You
Your
Z
Zero
Zone
[
\
abilities
ability
able
absolute
abstract
accept
access
account
ace
ache
ached
aching
acre
act
action
actions
active
activity
actor
actual
ad
add
added
adding
address
ads
aft
age
aged
agent
ages
aging
ago
ah
ain
air
airs
aka
al
album
ale
alert
algebra
algorithm
alias
aligned
allow
allowed
ally
alpha
alter
ample
anal
analysis
anchor
angel
anger
angle
angles
angular
animation
anonymous
answer
ant
anti
ants
app
apple
application
apply
approx
apps
arc
arch
architecture
archive
area
aren
argument
arguments
arm
array
arrow
art
article
articles
artifact
arts
ash
ask
ass
assembly
assert
asset
assets
assign
ate
atom
atomic
attach
attend
attribute
attributes
au
audio
authentic
author
auto
aux
available
avant
avid
aware
away
axis
b
background
bad
bag
ball
ban
band
bank
bar
bare
bars
base
based
basic
bat
batch
bay
bean
beans
bed
beg
begin
bell
ben
best
bet
beta
bi
bid
big
bin
binary
bind
binding
bio
bird
bishop
bit
bits
black
blank
blast
block
blog
blogs
blue
board
boards
body
bold
bone
book
books
boost
boot
border
born
borough
bound
bounded
bounds
bow
box
boy
br
bra
brace
brains
branch
brand
break
bridge
brow
browser
bucket
buffer
bug
build
builder
building
built
bullet
bundle
burn
bury
bus
button
bye
c
cache
calendar
called
camera
camp
cancel
canvas
cap
cape
car
card
cards
care
cart
case
cases
cast
castle
cat
catalog
catch
categories
category
caught
cc
cell
cement
cent
center
central
century
certain
ch
chain
change
changed
changes
channel
chant
chapter
character
charge
chart
charts
chat
check
checked
child
children
chin
choice
choose
chunk
circle
city
class
classes
clean
clear
click
client
clip
clock
clone
close
closed
closure
cloud
club
cluster
cm
co
cock
code
coded
codes
collapse
collect
collection
collections
color
colors
column
columns
com
comb
come
comes
coming
command
commands
comment
comments
commerce
commit
common
community
company
compare
compatible
compiler
complete
complex
component
components
compose
con
concurrent
condition
configuration
confirm
connect
connected
connection
console
constant
construct
contact
container
contains
content
contents
context
continue
control
controller
controls
convert
cook
cookie
coordinate
cop
cope
copy
cord
core
correct
cost
count
counter
country
course
court
cover
cow
craft
create
created
cross
cu
cue
cup
curl
currency
current
custom
customer
cut
cycle
d
da
dagger
dam
dark
dart
das
dash
data
database
date
dated
dates
dating
dawn
day
days
de
deck
deep
def
default
define
defined
definition
del
delay
delegate
delta
dem
demo
den
dependent
deploy
depth
der
des
description
design
desktop
destination
destroy
detail
details
develop
developer
developers
development
device
di
dictionary
die
dig
digit
dim
dimensional
din
dir
dire
direct
direction
directory
disabled
discussion
disk
dispatch
display
distance
distribution
document
documentation
dog
domain
don
door
dot
dots
double
download
drag
draw
drive
driver
drop
du
duct
dump
duration
dynamic
e
ear
ears
east
echo
eclipse
ed
edge
edit
editor
eds
effect
efficient
ego
eh
el
elect
element
elements
em
email
employee
en
enable
enabled
encoded
encoding
end
ended
ending
ends
energy
engine
ensemble
ensure
enter
entity
entries
entry
environment
equal
equality
equals
equation
er
era
error
errors
es
escape
est
et
etc
event
events
ex
example
examples
exception
exchange
execute
execution
exist
exists
exit
expand
expect
expected
export
exports
express
expression
extend
extension
extensions
external
extra
extract
f
face
faces
fact
factor
factory
fade
fail
failed
fall
falls
false
family
fan
far
fare
fast
father
fault
feature
features
feed
fetch
fi
fiddle
field
fields
figure
file
files
fill
filled
film
filter
filters
fin
final
find
finite
fire
fish
fit
fix
fixed
fl
flag
flags
flash
flat
float
floor
flow
flu
flush
flutter
fly
focus
fog
fold
folder
folk
follow
font
foot
football
force
fore
forge
form
format
formation
formed
forms
fort
forum
forward
found
fox
fragment
frame
frames
framework
free
fried
friend
ft
fully
fun
function
functions
fund
fur
für
g
gable
gal
game
gamma
gang
gas
gate
gel
gender
general
generate
generated
generator
generic
geometry
gets
getting
glass
global
goal
god
going
good
got
grade
gradient
gram
grand
graph
graphics
gravity
gray
green
grid
ground
group
groups
guard
guide
gun
h
ha
half
hall
halt
hand
handle
hang
hard
harm
hat
head
header
heart
heck
heel
height
hell
hello
helm
help
hem
hi
hidden
hide
high
highlight
hill
hind
hip
hips
hire
history
hit
ho
hold
holder
holds
hole
home
hood
hook
horizontal
horn
host
hosts
hot
hour
house
hp
html
http
https
hum
human
hung
ice
icon
icons
icy
idea
identity
ignore
ii
il
ill
image
images
imp
implementation
implies
import
important
inch
include
includes
including
index
info
information
ing
initial
ink
inn
inner
input
ins
insert
inside
install
installed
instance
integer
integration
intent
inter
interface
internal
interval
intro
invalid
ion
ions
issue
issues
item
items
j
jack
jar
jet
jets
ji
job
join
joint
k
ka
ked
keeper
kernel
key
keys
kill
kin
kind
king
kit
km
kn
know
known
l
la
lab
label
labels
lace
lack
lad
land
lands
lane
language
lap
laps
large
las
late
latest
launch
lava
law
lay
layer
layers
layout
lb
le
leading
leaf
lean
leans
learn
learning
lease
leased
led
ledge
left
leg
legal
legend
length
les
let
lets
letter
level
library
lick
lie
lied
lies
life
light
like
likely
lime
limit
limited
limits
limp
line
linear
lined
lines
link
links
lip
list
listen
listener
lists
lit
liter
live
liver
ll
lo
load
loaded
loading
loads
local
located
location
lock
locked
log
logging
logic
logo
logs
long
look
looking
loop
los
lose
loss
lost
lot
low
lower
lung
lying
m
ma
mac
machine
mad
mail
main
major
maker
making
male
man
managed
management
manager
manifest
manual
map
mapping
maps
margin
marine
mark
marker
market
marks
mask
mass
master
mat
match
matches
mate
material
math
matrix
maybe
mean
measure
media
medium
member
members
memory
men
menu
merge
mess
message
messages
met
meta
meter
method
methods
metric
metro
mi
mid
middle
mile
mill
min
mind
minister
minus
miss
missing
mission
mit
mix
mm
mobile
mock
mode
model
models
module
modules
mon
month
mount
mouse
mouth
movie
multi
multiple
museum
music
n
na
nak
named
names
nap
native
natural
navigation
ne
near
need
negative
nest
net
network
new
news
ng
ni
nice
night
nm
node
nodes
non
norm
normal
notation
note
notes
null
number
numbers
nut
née
o
object
objects
occupation
odd
odor
office
offs
offset
og
oh
ok
old
older
olds
ones
online
op
open
opens
opera
operation
operator
option
optional
options
oral
order
ordered
orders
ordinary
ore
org
organ
organisation
orientation
origin
original
ou
ought
ounce
outer
output
outs
oval
oven
owe
owed
owned
owner
oz
p
pace
pack
package
packages
pad
page
pages
pair
pan
panel
paper
par
para
paragraph
parallel
parameter
parameters
parent
park
partial
partition
parts
party
pass
password
paste
pat
patch
path
paths
pattern
pay
payload
payment
pen
people
percent
perform
period
permission
person
pet
phase
phone
photo
physics
pick
picture
pie
pin
pine
pipe
pit
place
plain
plan
plane
plant
plate
plates
platform
play
player
plays
plot
plots
plus
pm
pod
point
points
pole
policy
pond
pool
pop
port
portal
ports
pose
posed
poses
position
possible
post
posts
pot
power
pp
pre
predict
prefix
prepare
present
presentation
press
pressed
prevent
preview
previous
price
primary
prime
print
private
pro
problem
process
processing
processor
product
production
products
profile
program
programming
progress
project
projects
proof
prop
properties
property
protected
protocol
prototype
provider
ps
pu
pub
public
publish
pull
push
q
quality
quantity
quarters
que
quest
question
questions
quick
quit
quote
r
race
rack
radio
radius
rag
rage
raid
rails
rain
raise
ram
ran
ranch
random
range
rank
rap
rapper
rare
rat
rate
rating
raw
ray
react
read
reader
reading
ready
real
reason
record
red
reduce
refer
reference
reflect
region
register
regular
related
relation
relative
relax
release
remark
remote
remove
render
rent
repeat
replace
report
request
requests
require
required
resolve
resource
resources
respond
response
rest
result
results
return
returns
reverse
review
rib
rice
rich
rid
ride
rides
ridge
rift
rig
right
rim
ring
rip
rite
rival
river
road
rock
rod
role
roll
rolled
roller
rolling
room
rooms
root
rose
rot
rotate
rough
round
route
routes
row
rows
rug
rule
rules
run
runner
running
s
sa
safe
sample
samples
save
saved
scale
scan
scar
scene
school
scope
score
screen
script
scripts
scroll
se
search
season
second
seconds
secret
sect
section
sections
secure
security
seed
seen
segment
select
selected
selection
self
send
sent
sequence
serial
series
serve
server
service
services
session
set
sets
setting
settings
setup
sex
shadow
shape
share
shared
sharp
sheet
sheets
shell
shift
ship
ships
shop
short
shot
si
sign
signal
signed
similar
simple
sin
sing
single
site
sites
size
ski
skip
sky
slash
sleep
slice
slide
slow
small
soap
sob
social
socket
soft
software
sole
son
song
sort
sorted
sound
source
space
spaces
span
spark
special
species
specific
speed
split
spot
spring
sq
square
stab
stable
stack
stage
stand
standard
standing
star
start
starts
state
statement
states
static
station
status
step
steps
stock
stone
stood
stop
storage
store
story
strap
stream
street
string
strings
strip
stroke
strong
structure
stud
student
studio
style
styles
su
sub
subject
submit
subset
success
suit
suite
sum
summary
sun
super
support
supported
sur
swap
swift
swing
switch
symbol
syntax
system
t
ta
table
tables
tag
tags
tail
tan
target
task
tasks
tax
te
team
tech
teen
temper
template
tensor
term
test
testing
tests
text
th
theme
theorem
theory
thesis
thick
thing
thread
threads
throw
thy
ties
til
time
times
tiny
tip
title
today
token
ton
tons
tool
tools
topic
total
touch
town
trace
track
train
training
trans
transaction
transform
transition
translate
transport
tree
trees
triangle
trigger
trim
true
try
turn
type
types
u
uh
uk
ul
um
un
und
une
uniform
union
unique
unit
unity
unknown
unto
update
updated
upper
ups
urban
usable
usage
use
user
users
uses
utter
v
valid
value
values
van
var
variable
variables
variant
ve
vector
vendor
vent
venue
verb
verify
verse
version
versions
vertical
vest
vice
video
view
views
villa
virtual
visibility
visible
vision
visual
voice
void
vol
volume
von
vote
vs
w
wa
wait
walk
wall
war
ward
wards
warn
warning
watch
water
wave
way
ways
weak
wealth
web
website
wedge
week
weight
west
western
white
wide
width
win
wind
window
windows
wing
wire
wise
won
wood
word
words
work
worker
working
works
world
worth
wrap
write
writer
writing
written
www
x
y
ya
yard
yd
ye
year
yellow
yer
yes
yo
z
zero
zone
zu
|
¡
¢
£
§
¨
©
ª
¬
®
°
±
²
³
´
µ
¶
¹
º
¼
½
¾
¿
À
Á
Â
Ä
Å
Æ
Ç
È
É
Í
Î
Ñ
Ó
Ö
×
Ø
Ú
Ü
Þ
ß
à
á
â
ã
ä
å
æ
ç
è
é
état
ê
ë
ì
í
î
ï
ð
ñ
ò
ó
ô
õ
ö
ø
ù
ú
û
ü
ý
þ
ÿ
Ā
ā
ă
ą
Ć
ć
Č
č
ď
Đ
đ
ē
ė
ę
ě
ğ
ġ
Ħ
ħ
ĩ
Ī
ī
İ
ı
ļ
Ľ
ľ
Ł
ł
ń
ņ
ň
ŋ
Ō
ō
ŏ
ő
Œ
œ
ř
Ś
ś
Ş
ş
Š
š
Ţ
ţ
ť
ũ
ū
ŭ
ů
ű
ų
ź
Ż
ż
Ž
ž
Ə
ƒ
ư
ǎ
ǐ
ǔ
ǫ
Ș
ș
Ț
ț
ɐ
ɑ
ɕ
ə
ɛ
ɡ
ɣ
ɪ
ɲ
ɾ
ʀ
ʁ
ʂ
ʃ
ʊ
ʋ
ʌ
ʐ
ʑ
ʒ
ʔ
ʰ
ʷ
ʻ
ʼ
ʿ
ˈ
ː
́
̃
̍
͡
Α
Β
Γ
Δ
Ε
Η
Θ
Ι
Κ
Λ
Μ
Ν
Ο
Π
Σ
Τ
Φ
Χ
Ψ
Ω
ά
έ
ή
ί
α
β
γ
δ
ε
ζ
η
θ
ι
κ
λ
μ
ν
ξ
ο
π
ρ
ς
σ
υ
φ
χ
ψ
ω
ό
ύ
ώ
І
Ј
А
Б
В
Г
Д
Е
Ж
З
И
К
Л
М
Н
О
П
Р
С
Т
У
Ф
Х
Ц
Ч
Ш
Э
Ю
Я
а
б
в
г
д
е
ж
з
и
й
к
л
м
н
о
п
р
с
т
у
ф
ц
ч
ш
щ
ъ
ы
ь
э
ю
я
ё
і
ї
ј
њ
ћ
Ա
Հ
ա
ե
ի
կ
յ
ն
ո
ս
տ
ր
ւ
ִ
ֵ
ֶ
ַ
ָ
ֹ
א
ב
ג
ד
ה
ו
ז
ח
ט
י
כ
ל
ם
מ
ן
ס
ע
פ
צ
ק
ר
ש
ת
ء
آ
أ
إ
ئ
ا
ب
ة
ت
ث
ج
ح
خ
د
ذ
ر
ز
س
ش
ص
ض
ط
ظ
ع
غ
ق
ك
ل
م
ن
ه
و
ى
ي
َ
ِ
چ
ک
گ
ہ
ی
ے
ं
आ
क
ग
च
ज
ण
त
द
ध
न
प
ब
भ
म
य
र
ल
व
श
ष
स
ह
ा
ि
ी
ु
े
ो
्
।
ক
গ
জ
ত
দ
ন
প
ব
ম
য
র
ল
শ
স
হ
া
ি
ী
ু
ে
্
க
த
ப
ம
ய
ர
ல
வ
ா
ி
ு
்
ร
་
ག
ང
ད
ན
བ
མ
ར
ལ
ས
ི
ུ
ེ
ོ
ა
ე
ი
ნ
ს
ᵉ
Ḥ
ḥ
Ḩ
ḩ
ḳ
ṃ
ṅ
ṇ
ṛ
ṣ
ṭ
ạ
ả
ấ
ầ
ậ
ắ
ế
ề
ể
ễ
ệ
ị
ọ
ố
ồ
ộ
ớ
ờ
ợ
ụ
ủ
ứ
ữ
ỳ
ỹ
ἀ
ἐ
ὁ
ὐ
ὰ
ὶ
ὸ
ῆ
ῖ
ῦ
ῶ
‐
‑
‒
―
‖
‚
†
‡
•
‰
′
″
⁄
⁰
⁴
⁵
⁶
⁷
⁸
⁹
⁻
ⁿ
₀
₁
₂
₃
₄
₅
₆
₇
₈
₉
₹
ℓ
№
ℝ
⅓
←
↑
↔
⇒
∂
∈
−
∗
∘
√
∞
∧
∩
∪
≈
≠
≡
≤
⊂
⊆
⊕
⋅
■
●
★
☆
☉
♠
♣
♥
♦
♭
♯
⟨
⟩
、
。
《
》
「
」
『
』
〜
い
う
え
お
き
く
け
こ
さ
し
す
せ
そ
た
ち
つ
て
と
な
に
の
は
ひ
ま
み
む
め
も
や
ゆ
よ
ら
り
る
れ
ん
ア
ィ
イ
ウ
エ
オ
カ
ガ
キ
ク
グ
コ
サ
シ
ジ
ス
ズ
タ
ダ
ッ
テ
デ
ト
ド
ナ
ニ
ハ
バ
パ
フ
ブ
プ
マ
ミ
ム
ャ
ュ
ラ
リ
ル
レ
ロ
ン
ー
三
上
下
中
事
二
井
京
人
仁
佐
光
公
力
北
十
南
原
口
史
司
吉
同
和
国
國
土
士
大
天
太
夫
女
子
安
宮
宿
山
島
川
州
平
年
心
戸
文
新
方
日
明
星
書
月
木
本
李
村
東
松
林
正
武
氏
水
江
河
海
版
王
生
田
白
皇
省
真
石
社
神
竹
美
義
花
藤
西
谷
車
道
郎
郡
部
野
金
長
門
陽
食
馬
高
龍
씨
의
이
한
ﬁ
－
